LEXICON_RU: dict[str, str] = {
    '/start': '📌 Кнопкой "Menu"\n(В левой, нижней части экрана)\n\n'
              'Либо прочитать:\n\n'
              '📋 Справку о работе бота /help',

    '/help':  '📚 <b>Информационные ресурсам</b> /info_resources\n\n'
              '🔍 Википедия\n\n'
              '📺 Новости\n\n'
              '😆 Свежие анекдоты\n\n'
              '⛅ Погода\n\n\n'
              '📇 <b>Вспомогательные функции</b> /assist_user\n\n'
              '🔊 Текст в mp3.\n\n'
              '⚛ Искусственный интеллект\n\n'
              'и многое другое.',

    '/info_resources':  'Нажмите на одну из кнопок',

    '/assist_user': 'Выбирайте одну из перечисленных функций',

    '/developers': 'Нажмите на одну из кнопок',

    'wiki':   '🔍 Википедия',

    'open_weather': '⛅ Прогноз погоды',

    'message_mp3': '🔊 Преобразовать сообщения в mp3',

    'chat_gpt': '⚛ Написать ИИ',

    'news': '📺 Новости',

    'joke': '😆 Анекдоты',

    'chat_gpt_answer': 'Вас приветствует ИИ',

    'message_mp3_answer': 'Введите текст, который необходимо преобразовать в голосовой формат',

    'button_no_info': '❌ Выход',

    'no_text': 'Если будут нужны какие-то функции, воспользуйтесь кнопкой "Menu"',

    'button_back': '🔙 Назад'
}


LEXICON_INFO_RU: dict[str, str] = {
    'wiki_answer': 'Что вы хотите узнать?\n'
                   'Введите текст для запроса',
    'open_weather_answer': 'Если названия города нет в списке\n'
                           'вы можете написать название города в сообщении'
}


LEXICON_MENU_RU: dict[str, str] = {
    '/help': 'Справка о работе бота',
    '/info_resources': 'Доступ к информационным ресурсам',
    '/assist_user': 'Вспомогательные функции',
    '/developers': 'Обратная связь'
}


LEXICON_ADMIN_RU: dict[str, str] = {
    '/admin': 'Вы вошли в админ панель',
    'deleted_menu': 'Удалить кнопку меню',
    'no_button_admin': 'Выйти из админ панели',
    'no_text': 'Вы выши из админ панели'
}


LEXICON_DEVELOPERS_RU: dict[str, str] = {
    'comment': 'Оставить отзыв, пожелание',

    'comment_answer': 'Напишите одним предложением, отзыв, комментарий, пожелание или како-либо предложение'
                      ' по работе или улучшению бота',

    'comment_save': 'Спасибо за отзыв, мы обязательно его прочтем'
}
