LEXICON_RU: dict[str, str] = {
    '/start': '📋 /help - справка о боте\n\n'
              '📚 /info_resources - информационные ресурсы\n\n'
              '📇 /assist_user - вспомогательные функции\n\n'
              '📲 /developers - обратная связь\n\n'
              '⬇️ Все команды так же доступны в Меню',

    '/help':  'Бот сделан на основе ИИ, в простом общении может отвечать на любые вопросы.\n'
              'Так же у бота есть свой функционал, он доступен при отправке соответствующей команды, '
              'все команды так же доступны в Меню в нижней, левой части экрана.\n'
              'Проект постоянно развивается, появляется новый функционал, улучшается его работа, '
              'все это делается для удобства использования бота.\n\n'
              'Вы так же можете поучаствовать в развитии бота, оставив отзыв, комментарий или предложение '
              'по развитию функционала проекта 📲 /developers',

    '/info_resources':  '<b>✅ Тут вы можете получать различную информацию, узнать погоду за окном, '
                        'прочитать свежие новости и многое другое.</b>\n\n'
                        '<b>⬇️ Ниже представлен список сервисов, выберите нужный вам:</b>',

    '/assist_user': 'Выбирайте одну из перечисленных функций',

    '/developers': 'Нажмите на одну из кнопок',

    'wiki':   '🔍 Википедия',

    'open_weather': '⛅ Прогноз погоды',

    'message_mp3': '🔊 Преобразовать сообщения в mp3',

    'news': '📺 Новости',

    'joke': '😆 Анекдоты',

    'message_mp3_answer': 'Введите текст, который необходимо преобразовать в голосовой формат',

    'button_no_info': '❌ Выход',

    'no_text': 'Если будут нужны какие-то функции, воспользуйтесь кнопкой "Menu"',

    'button_back': '🔙 Назад'
}


LEXICON_INFO_RU: dict[str, str] = {
    'wiki_answer': 'Что вы хотите узнать?\nВведите текст:',

    'open_weather_answer': 'Напишите название города',

    'open_weather_more': 'В каком городе, вы еще хотите узнать погоду?',

    'open_weather_press_button': ''
}


LEXICON_MENU_RU: dict[str, str] = {
    '/help': 'Справка о работе бота',

    '/info_resources': 'Информационные ресурсы',

    '/assist_user': 'Вспомогательные функции',

    '/developers': 'Обратная связь'
}


LEXICON_ADMIN_RU: dict[str, str] = {
    '/admin': 'Вы вошли в админ панель',

    'deleted_menu': 'Удалить кнопку меню',

    'no_button_admin': 'Выйти из админ панели',

    'no_text': 'Вы выши из админ панели'
}


LEXICON_DEVELOPERS_RU: dict[str, str] = {
    'comment': 'Оставить отзыв, пожелание',

    'comment_answer': 'Напишите одним предложением, отзыв, комментарий, пожелание или како-либо предложение'
                      ' по работе или улучшению бота',

    'comment_save': 'Спасибо за отзыв, мы обязательно его прочтем'
}
